app/views/interviews/index.html.erb

      <div class="styled-select">
      <%= select_tag('interviewer_filter', options_from_collection_for_select(User.interview_panel.collect{|u| [ u.id, u.name ] }, :first, :last, params[:interviewer_filter]), {:prompt => "Filter Interviews By"} ) %>
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`user_id` = 3