app/controllers/interviews_controller.rb

  def show
    @interview = Interview.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1

  def edit
    @interview = @candidate.interviews.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1

  def create
    @interview = @candidate.interviews.new(params[:interview])
    respond_to do |format|
      if @interview.save
---
INSERT INTO `interviews` (`candidate_id`, `created_at`, `schedule_time`, `scheduled_at`, `updated_at`, `user_id`) VALUES (NULL, '2011-10-21 04:55:21', NULL, NULL, '2011-10-21 04:55:21', NULL)

  def update
    @interview = @candidate.interviews.find(params[:id])
    respond_to do |format|
      if @interview.update_attributes(params[:interview])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 3 LIMIT 1
UPDATE `interviews` SET `schedule_time` = '21:50', `updated_at` = '2011-10-21 10:29:33' WHERE `interviews`.`id` = 3