app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page])
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `token`, `token_created_at`, `type`, `updated_at`, `username`) VALUES ('2011-10-20 12:09:17', 'rap@rap.com', 'Paddy', '$2a$10$gaDj9ejCxOu4ilqRKNUaReeF/lys9f/863rhuBwLHew3BwaZBkxIe', NULL, NULL, NULL, '2011-10-20 12:09:17', 'rap1')

  def update
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1